from dataclasses import dataclass

@dataclass
class Entity: # 속성만 처리하는 Entity
        pass

    #  역할분담. 

'''
    지도학습을 하는 데이터 분석모델을 item 을 만들어 주세요
    왜 구조를 중요하게 여기느냐? 
    아파트 브랜드가 많은데 몇 평? 방 몇 개? 대충 구조 알아. 
    각 차 마다 가격도 달라. 내부의 구조 작동범위는 다 똑같기 때문에
    인공지능 모델링을 연습을 해서 
    모델링 구축방법을 연습하는것임. 우린 연구자가 아니니까 특정 알고리즘 
    아니라는거 우리가 가는 방향은 한달 반 동안
    알고리즘 개발 할 시간은 없고 알고리즘 되어있는 걸 가져다 쓴다. 
    한달동안 객체지향프로그래밍을 배우는 것.
    있는 라이브러리를 가져다가 응용해서 만들어 내는 훈련을 하는 것.
    회사는 당장 이걸 할 수 있는 인력을 필요로 한다. 


    '''